# git = это система управления версиями кода

# github - сайт, который дает хранилище для кода
# также есть gitlab, bitbucket

# репозиторий - папка с проектомс которой может работать git

# ssh-keygen - создание ключа

# git config --global user.name "your-name"
# git comfig --global user.email "your-eamil"
#  указание своих данных

# git init - превратить папку в репозиторий
# создает скрытую папку .git

# git remote add origin < ссылка на репозиторий> - добавить ссылку на репозиторий в переменную git 

# git add . / filename - добавляет указанные файлы в индекс / начинает отслеживание файлов

# git commit -m "название для версии" - создание версии кода / создать сохрание кода

# git push origin имя_ветки - отправить версию кода на github


